[
  {
    "user_name": "Margriet",
    "date_posted": "May 2025",
    "stars": 5,
    "review_text": "Together with my partner and daughter we had a wonderful trip from Palma. We had an overnight stay and the food was well arranged! Definitely recommended, also with children. There was plenty of attention and space for questions and thought with it, which I experienced as very pleasant. Unfortunately we were only there for 1 night. So I'm definitely going to book here again!"
  },
  {
    "user_name": "Douwien V",
    "date_posted": "April 2025",
    "stars": 5,
    "review_text": "It was fantastic days on this boat with a nice crew and with my friends together it was lovely. As soon as you sail on the water it gives a wonderful rest and with good weather and good company and good food it can not break anymore!"
  },
  {
    "user_name": "Jantine H",
    "date_posted": "February 2025",
    "stars": 5,
    "review_text": "It was a very exclusive experience! A trip to remember, we were warmly welcomed and the whole trip wonderfully cared for and laughed every day! We have decided to book according to weather"
  },
  {
    "user_name": "Jeroen D",
    "date_posted": "May 2025",
    "stars": 5,
    "review_text": "I have greatly enjoyed this wonderful experience together with friends – a moment not to be forgotten. I would therefore recommend it to anyone looking for a relaxing and fun activity. The crew was friendly and professional, and made sure everything went smoothly. Everything was also neatly clean, which made the whole experience even more pleasant. We are already looking forward to next time!"
  },
  {
    "user_name": "Annelien D",
    "date_posted": "March 2025",
    "stars": 5,
    "review_text": "We did a boat trip with crew on Mallorca and it was a really great experience. The crew was friendly, professional and made us feel at ease immediately. The boat itself was comfortable and well maintained. Along the way we enjoyed beautiful views, crystal clear water and beautiful bays to swim in. All in all, it was a super fun and beautiful experience – highly recommended for anyone visiting Mallorca!"
  },
  {
    "user_name": "Nicky R",
    "date_posted": "March 2025",
    "stars": 5,
    "review_text": "During our holiday in Mallorca we rented a sailboat with our family. A great experience! The boat was in top condition, neat and comfortable. We enjoyed the sea views, the sailing itself and swimming in quiet coves. Everything was well arranged by the rental company, from explanations to service. A perfect day on the water that we will not forget in a hurry!"
  },
  {
    "user_name": "Jan B",
    "date_posted": "April 2025",
    "stars": 5,
    "review_text": "We had a super fun trip to Ibiza aboard the Iron Monkey. Everything was taken care of to perfection. The crew was very friendly, professional and made sure everyone felt comfortable. The food was fine: fresh, tasty and more than adequate. A wonderful day on the water."
  }
]